---
type: ElementNode
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementNode

`Autodesk.Revit.DB.ElementNode` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Document | 2020 | `public Document Document { get ; }` |
| Property | ElementId | 2020 | `public ElementId ElementId { get ; }` |
| Property | LinkInstanceId | 2020 | `public ElementId LinkInstanceId { get ; }` |